convesys/CS-1211_Test/05_Project/SW_TEST_sysconfig_337zwt/c2000.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F2837xD" --part "F2837xD_337ZWT" --package "F2837xD_337ZWT" --context "CPU1" --product "C2000WARE@6.00.00.00"
 * @v2CliArgs --device "TMS320F28379D" --package "337ZWT" --context "CPU1" --product "C2000WARE@6.00.00.00"
 * @versions {"tool":"1.24.2+4234"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc            = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1           = adc.addInstance();
const adc2           = adc.addInstance();
const adc3           = adc.addInstance();
const adc4           = adc.addInstance();
const led            = scripting.addModule("/driverlib/board_components/led", {}, false);
const led1           = led.addInstance();
const led2           = led.addInstance();
const led3           = led.addInstance();
const led4           = led.addInstance();
const cputimer       = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1      = cputimer.addInstance();
const cputimer2      = cputimer.addInstance();
const dac            = scripting.addModule("/driverlib/dac.js", {}, false);
const dac1           = dac.addInstance();
const dac2           = dac.addInstance();
const dac3           = dac.addInstance();
const device_support = scripting.addModule("/driverlib/device_support.js");
const dma            = scripting.addModule("/driverlib/dma.js", {}, false);
const dma1           = dma.addInstance();
const dma2           = dma.addInstance();
const dma3           = dma.addInstance();
const dma4           = dma.addInstance();
const gpio           = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio5          = gpio.addInstance();
const gpio6          = gpio.addInstance();
const gpio7          = gpio.addInstance();
const gpio8          = gpio.addInstance();
const gpio9          = gpio.addInstance();
const gpio10         = gpio.addInstance();
const gpio11         = gpio.addInstance();
const gpio12         = gpio.addInstance();
const gpio13         = gpio.addInstance();
const gpio14         = gpio.addInstance();
const gpio15         = gpio.addInstance();
const gpio16         = gpio.addInstance();
const gpio17         = gpio.addInstance();
const gpio18         = gpio.addInstance();
const gpio19         = gpio.addInstance();
const gpio20         = gpio.addInstance();
const gpio21         = gpio.addInstance();
const gpio22         = gpio.addInstance();
const gpio23         = gpio.addInstance();
const gpio24         = gpio.addInstance();
const gpio25         = gpio.addInstance();
const gpio26         = gpio.addInstance();
const gpio27         = gpio.addInstance();
const gpio28         = gpio.addInstance();
const gpio29         = gpio.addInstance();
const gpio30         = gpio.addInstance();
const gpio31         = gpio.addInstance();
const gpio32         = gpio.addInstance();
const gpio33         = gpio.addInstance();
const gpio34         = gpio.addInstance();
const gpio35         = gpio.addInstance();
const gpio36         = gpio.addInstance();
const gpio37         = gpio.addInstance();
const gpio38         = gpio.addInstance();
const gpio39         = gpio.addInstance();
const gpio40         = gpio.addInstance();
const gpio41         = gpio.addInstance();
const gpio42         = gpio.addInstance();
const gpio43         = gpio.addInstance();
const gpio44         = gpio.addInstance();
const gpio45         = gpio.addInstance();
const gpio46         = gpio.addInstance();
const gpio47         = gpio.addInstance();
const gpio48         = gpio.addInstance();
const gpio49         = gpio.addInstance();
const gpio50         = gpio.addInstance();
const gpio51         = gpio.addInstance();
const gpio52         = gpio.addInstance();
const gpio53         = gpio.addInstance();
const gpio54         = gpio.addInstance();
const gpio55         = gpio.addInstance();
const gpio56         = gpio.addInstance();
const gpio57         = gpio.addInstance();
const gpio58         = gpio.addInstance();
const gpio59         = gpio.addInstance();
const gpio60         = gpio.addInstance();
const gpio61         = gpio.addInstance();
const gpio62         = gpio.addInstance();
const gpio63         = gpio.addInstance();
const gpio64         = gpio.addInstance();
const gpio65         = gpio.addInstance();
const gpio66         = gpio.addInstance();
const gpio67         = gpio.addInstance();
const gpio68         = gpio.addInstance();
const gpio69         = gpio.addInstance();
const gpio70         = gpio.addInstance();
const gpio71         = gpio.addInstance();
const gpio72         = gpio.addInstance();
const gpio73         = gpio.addInstance();
const gpio74         = gpio.addInstance();
const gpio75         = gpio.addInstance();
const gpio76         = gpio.addInstance();
const gpio77         = gpio.addInstance();
const gpio78         = gpio.addInstance();
const gpio79         = gpio.addInstance();
const gpio80         = gpio.addInstance();
const gpio81         = gpio.addInstance();
const gpio82         = gpio.addInstance();
const gpio83         = gpio.addInstance();
const gpio84         = gpio.addInstance();
const gpio85         = gpio.addInstance();
const gpio86         = gpio.addInstance();
const gpio87         = gpio.addInstance();
const gpio88         = gpio.addInstance();
const gpio89         = gpio.addInstance();
const gpio90         = gpio.addInstance();
const gpio91         = gpio.addInstance();
const gpio92         = gpio.addInstance();
const gpio93         = gpio.addInstance();
const gpio94         = gpio.addInstance();
const gpio95         = gpio.addInstance();
const gpio96         = gpio.addInstance();
const gpio97         = gpio.addInstance();
const gpio98         = gpio.addInstance();
const gpio99         = gpio.addInstance();
const gpio100        = gpio.addInstance();
const gpio101        = gpio.addInstance();
const gpio102        = gpio.addInstance();
const gpio103        = gpio.addInstance();
const gpio104        = gpio.addInstance();
const sci            = scripting.addModule("/driverlib/sci.js", {}, false);
const sci1           = sci.addInstance();
const sysctl         = scripting.addModule("/driverlib/sysctl.js");

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name                   = "ADCA_inst";
adc1.soc0SampleWindow        = 500;
adc1.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc1.soc1copyFrom            = "SOC0";
adc1.soc1SampleWindow        = 500;
adc1.soc2copyFrom            = "SOC1";
adc1.soc2SampleWindow        = 500;
adc1.soc3copyFrom            = "SOC0";
adc1.soc3SampleWindow        = 500;
adc1.soc4copyFrom            = "SOC1";
adc1.soc4SampleWindow        = 500;
adc1.soc5copyFrom            = "SOC1";
adc1.soc5SampleWindow        = 500;
adc1.soc1Channel             = "ADC_CH_ADCIN1";
adc1.soc2Channel             = "ADC_CH_ADCIN2";
adc1.soc3Channel             = "ADC_CH_ADCIN3";
adc1.soc4Channel             = "ADC_CH_ADCIN4";
adc1.soc5Channel             = "ADC_CH_ADCIN5";
adc1.socHighPriorityMode     = "ADC_PRI_ALL_HIPRI";
adc1.burstSize               = 5;
adc1.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc1.enableBurstMode         = true;
adc1.enabledInts             = ["ADC_INT_NUMBER1","ADC_INT_NUMBER2"];
adc1.registerInterrupts      = ["1","2","3","4"];
adc1.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc1.adcInt1.enableInterrupt = true;
adc1.adcInt2.enableInterrupt = true;
adc1.adcInt3.enableInterrupt = true;
adc1.adcInt4.enableInterrupt = true;

adc2.adcBase                 = "ADCB_BASE";
adc2.$name                   = "ADCB_inst";
adc2.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc2.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc2.soc0SampleWindow        = 500;
adc2.soc1Channel             = "ADC_CH_ADCIN1";
adc2.soc1SampleWindow        = 500;
adc2.soc3Channel             = "ADC_CH_ADCIN3";
adc2.soc3SampleWindow        = 500;
adc2.soc2Channel             = "ADC_CH_ADCIN2";
adc2.soc2SampleWindow        = 500;
adc2.soc4Channel             = "ADC_CH_ADCIN4";
adc2.soc4SampleWindow        = 500;
adc2.soc5Channel             = "ADC_CH_ADCIN5";
adc2.soc5SampleWindow        = 500;
adc2.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc2.burstSize               = 5;
adc2.enableBurstMode         = true;
adc2.enabledInts             = ["ADC_INT_NUMBER1","ADC_INT_NUMBER2"];
adc2.registerInterrupts      = ["1","2","3","4"];
adc2.adcInt1.enableInterrupt = true;
adc2.adcInt2.enableInterrupt = true;
adc2.adcInt3.enableInterrupt = true;
adc2.adcInt4.enableInterrupt = true;

adc3.adcBase                 = "ADCC_BASE";
adc3.$name                   = "ADCC_inst";
adc3.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc3.soc2SampleWindow        = 500;
adc3.soc2Channel             = "ADC_CH_ADCIN2";
adc3.soc3SampleWindow        = 500;
adc3.soc3Channel             = "ADC_CH_ADCIN3";
adc3.soc4Channel             = "ADC_CH_ADCIN4";
adc3.soc4SampleWindow        = 500;
adc3.soc5Channel             = "ADC_CH_ADCIN5";
adc3.soc5SampleWindow        = 500;
adc3.soc14SampleWindow       = 500;
adc3.soc14Channel            = "ADC_CH_ADCIN14";
adc3.soc15SampleWindow       = 500;
adc3.soc15Channel            = "ADC_CH_ADCIN15";
adc3.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc3.soc0Channel             = "ADC_CH_ADCIN14";
adc3.soc0SampleWindow        = 500;
adc3.soc1SampleWindow        = 500;
adc3.soc1Channel             = "ADC_CH_ADCIN15";
adc3.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc3.burstSize               = 5;
adc3.enableBurstMode         = true;
adc3.enabledInts             = ["ADC_INT_NUMBER1","ADC_INT_NUMBER2"];
adc3.registerInterrupts      = ["1","2","3","4"];
adc3.adcInt1.enableInterrupt = true;
adc3.adcInt2.enableInterrupt = true;
adc3.adcInt3.enableInterrupt = true;
adc3.adcInt4.enableInterrupt = true;

adc4.adcClockPrescaler       = "ADC_CLK_DIV_4_0";
adc4.enabledSOCs             = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc4.soc0SampleWindow        = 500;
adc4.soc1Channel             = "ADC_CH_ADCIN1";
adc4.soc1SampleWindow        = 500;
adc4.soc3Channel             = "ADC_CH_ADCIN3";
adc4.soc3SampleWindow        = 500;
adc4.soc2Channel             = "ADC_CH_ADCIN2";
adc4.soc2SampleWindow        = 500;
adc4.soc4Channel             = "ADC_CH_ADCIN4";
adc4.soc4SampleWindow        = 500;
adc4.soc5Channel             = "ADC_CH_ADCIN5";
adc4.soc5SampleWindow        = 500;
adc4.adcBase                 = "ADCD_BASE";
adc4.$name                   = "ADCD_inst";
adc4.burstSize               = 5;
adc4.interruptPulseMode      = "ADC_PULSE_END_OF_CONV";
adc4.enableBurstMode         = true;
adc4.enabledInts             = ["ADC_INT_NUMBER1","ADC_INT_NUMBER2"];
adc4.registerInterrupts      = ["1","2","3","4"];
adc4.adcInt1.enableInterrupt = true;
adc4.adcInt2.enableInterrupt = true;
adc4.adcInt3.enableInterrupt = true;
adc4.adcInt4.enableInterrupt = true;

led1.$name                  = "LED1";
led1.gpio.writeInitialValue = true;
led1.gpio.gpioPin.$assign   = "GPIO18";

led2.$name                  = "LED2";
led2.gpio.writeInitialValue = true;
led2.gpio.gpioPin.$assign   = "GPIO17";

