convesys/CS-1211_Test/05_Project/SW_TEST_sysconfig_337zwt/c2000.syscfg
led3.$name                  = "LED3";
led3.gpio.writeInitialValue = true;
led3.gpio.gpioPin.$assign   = "GPIO16";

led4.$name                  = "LED4";
led4.gpio.writeInitialValue = true;
led4.gpio.gpioPin.$assign   = "GPIO19";

const divider3 = system.clockTree["EPWMCLKDIV"];
scripting.suppress("ePWM TZFRC and TZCLR events will sometimes be missed when EPWMCLKDIV is divide by 2\\. Always program EPWMCLKDIV to divide by 1 if using TZFRC or TZCLR register\\. Please refer to the F2837xD Silicon Errata for more details\\.", divider3, "EPWMCLK");

const multiplier4         = system.clockTree["PLL_IMULT"];
multiplier4.multiplyValue = 20;

const pinFunction3     = system.clockTree["XTAL"];
pinFunction3.XTAL_Freq = 20;

cputimer1.$name                    = "CPUTIMER0_inst";
cputimer1.registerInterrupts       = true;
cputimer1.startTimer               = true;
cputimer1.enableInterrupt          = true;
cputimer1.timerPrescaler           = 200;
cputimer1.timerPeriod              = 50;
cputimer1.timerInt.enableInterrupt = true;

cputimer2.$name          = "CPUTIMER1_inst";
cputimer2.cputimerBase   = "CPUTIMER1_BASE";
cputimer2.startTimer     = true;
cputimer2.emulationMode  = "CPUTIMER_EMULATIONMODE_RUNFREE";
cputimer2.timerPeriod    = 65535;
cputimer2.timerPrescaler = 100;

dac1.$name            = "DACA_inst";
dac1.referenceVoltage = "DAC_REF_ADC_VREFHI";

dac2.$name            = "DACB_inst";
dac2.dacBase          = "DACB_BASE";
dac2.referenceVoltage = "DAC_REF_ADC_VREFHI";

dac3.$name            = "DACC_inst";
dac3.dacBase          = "DACC_BASE";
dac3.referenceVoltage = "DAC_REF_ADC_VREFHI";

const default_warning = scripting.addModule("/driverlib/default_warning.js", {}, false);
scripting.suppress("Add the \'Device Support\' module in order to use Clock Tree tool and generate device support files\\. This suggestion can be ignored if not using the Clock Tree tool\\.", default_warning);

dma1.useInterrupts          = true;
dma1.registerInterrupts     = true;
dma1.enableInterrupts       = true;
dma1.enableOverrunInterrupt = true;
dma1.interruptMode          = "DMA_INT_AT_END";
dma1.enableTriggers         = true;
dma1.destAddressInputMode   = "VARIABLE";
dma1.emulationMode          = "DMA_EMULATION_FREE_RUN";
dma1.destAddressVariable    = "ADCA_ResultBufferPtr";
dma1.srcAddressInputMode    = "VARIABLE";
dma1.srcAddressVariable     = "ADCA_ResultRegisterPtr";
dma1.startChannel           = true;
dma1.triggerSource          = "DMA_TRIGGER_ADCA2";
dma1.burstSize              = 16;
dma1.srcBurstStep           = 1;
dma1.srcTransferStep        = -15;
dma1.destBurstStep          = 1;
dma1.destWrapSize           = 65536;
dma1.srcWrapSize            = 65536;
dma1.destTransferStep       = 1;
dma1.$name                  = "DMA1_inst";
dma1.transferSize           = 256;
dma1.dmaInt.enableInterrupt = true;

dma2.useInterrupts          = true;
dma2.registerInterrupts     = true;
dma2.enableInterrupts       = true;
dma2.enableOverrunInterrupt = true;
dma2.interruptMode          = "DMA_INT_AT_END";
dma2.enableTriggers         = true;
dma2.destAddressInputMode   = "VARIABLE";
dma2.srcAddressInputMode    = "VARIABLE";
dma2.startChannel           = true;
dma2.burstSize              = 16;
dma2.srcBurstStep           = 1;
dma2.srcTransferStep        = -15;
dma2.destBurstStep          = 1;
dma2.destWrapSize           = 65536;
dma2.srcWrapSize            = 65536;
dma2.destTransferStep       = 1;
dma2.dmaBase                = "DMA_CH2_BASE";
dma2.triggerSource          = "DMA_TRIGGER_ADCB2";
dma2.srcAddressVariable     = "ADCB_ResultRegisterPtr";
dma2.destAddressVariable    = "ADCB_ResultBufferPtr";
dma2.$name                  = "DMA2_inst";
dma2.emulationMode          = "DMA_EMULATION_FREE_RUN";
dma2.transferSize           = 256;
dma2.dmaInt.enableInterrupt = true;

dma3.useInterrupts          = true;
dma3.registerInterrupts     = true;
dma3.enableInterrupts       = true;
dma3.enableOverrunInterrupt = true;
dma3.interruptMode          = "DMA_INT_AT_END";
dma3.enableTriggers         = true;
dma3.destAddressInputMode   = "VARIABLE";
dma3.emulationMode          = "DMA_EMULATION_FREE_RUN";
dma3.srcAddressInputMode    = "VARIABLE";
dma3.startChannel           = true;
dma3.burstSize              = 16;
dma3.srcBurstStep           = 1;
dma3.srcTransferStep        = -15;
dma3.destBurstStep          = 1;
dma3.destWrapSize           = 65536;
dma3.srcWrapSize            = 65536;
dma3.destTransferStep       = 1;
dma3.$name                  = "DMA3_inst";
dma3.dmaBase                = "DMA_CH3_BASE";
dma3.triggerSource          = "DMA_TRIGGER_ADCC2";
dma3.srcAddressVariable     = "ADCC_ResultRegisterPtr";
dma3.destAddressVariable    = "ADCC_ResultBufferPtr";
dma3.transferSize           = 256;
dma3.dmaInt.enableInterrupt = true;

dma4.useInterrupts          = true;
dma4.registerInterrupts     = true;
dma4.enableInterrupts       = true;
dma4.enableOverrunInterrupt = true;
dma4.interruptMode          = "DMA_INT_AT_END";
dma4.enableTriggers         = true;
dma4.destAddressInputMode   = "VARIABLE";
dma4.emulationMode          = "DMA_EMULATION_FREE_RUN";
dma4.srcAddressInputMode    = "VARIABLE";
dma4.startChannel           = true;
dma4.burstSize              = 16;
dma4.srcBurstStep           = 1;
dma4.srcTransferStep        = -15;
dma4.destBurstStep          = 1;
dma4.destWrapSize           = 65536;
dma4.srcWrapSize            = 65536;
dma4.destTransferStep       = 1;
dma4.$name                  = "DMA4_inst";
dma4.dmaBase                = "DMA_CH4_BASE";
dma4.triggerSource          = "DMA_TRIGGER_ADCD2";
dma4.srcAddressVariable     = "ADCD_ResultRegisterPtr";
dma4.destAddressVariable    = "ADCD_ResultBufferPtr";
dma4.transferSize           = 256;
dma4.dmaInt.enableInterrupt = true;

gpio5.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio5.$name           = "inst_GPIO2";
gpio5.gpioPin.$assign = "GPIO2";

gpio6.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio6.$name           = "inst_GPIO3";
gpio6.gpioPin.$assign = "GPIO3";

gpio7.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio7.$name           = "inst_GPIO4";
gpio7.gpioPin.$assign = "GPIO4";

gpio8.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio8.$name           = "inst_GPIO5";
gpio8.gpioPin.$assign = "GPIO5";

