convesys/CS-1211_Test/05_Project/SW_TEST_sysconfig_337zwt/c2000.syscfg
gpio9.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio9.$name           = "inst_GPIO6";
gpio9.gpioPin.$assign = "GPIO6";

gpio10.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio10.$name           = "inst_GPIO7";
gpio10.gpioPin.$assign = "GPIO7";

gpio11.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio11.$name           = "inst_GPIO8";
gpio11.gpioPin.$assign = "GPIO8";

gpio12.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio12.$name           = "inst_GPIO9";
gpio12.gpioPin.$assign = "GPIO9";

gpio13.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio13.$name           = "inst_GPIO11";
gpio13.gpioPin.$assign = "GPIO11";

gpio14.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio14.$name           = "inst_GPIO12";
gpio14.gpioPin.$assign = "GPIO12";

gpio15.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio15.$name           = "inst_GPIO13";
gpio15.gpioPin.$assign = "GPIO13";

gpio16.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio16.$name           = "inst_GPIO14";
gpio16.gpioPin.$assign = "GPIO14";

gpio17.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio17.$name           = "inst_GPIO15";
gpio17.gpioPin.$assign = "GPIO15";

gpio18.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio18.$name           = "inst_GPIO10";
gpio18.gpioPin.$assign = "GPIO10";

gpio19.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio19.$name           = "inst_GPIO20";
gpio19.gpioPin.$assign = "GPIO20";

gpio20.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio20.$name           = "inst_GPIO21";
gpio20.gpioPin.$assign = "GPIO21";

gpio21.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio21.$name           = "inst_GPIO22";
gpio21.gpioPin.$assign = "GPIO22";

gpio22.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio22.$name           = "inst_GPIO23";
gpio22.gpioPin.$assign = "GPIO23";

gpio23.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio23.$name           = "inst_GPIO24";
gpio23.gpioPin.$assign = "GPIO24";

gpio24.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio24.$name           = "inst_GPIO25";
gpio24.gpioPin.$assign = "GPIO25";

gpio25.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio25.$name           = "inst_GPIO26";
gpio25.gpioPin.$assign = "GPIO26";

gpio26.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio26.$name           = "inst_GPIO27";
gpio26.gpioPin.$assign = "GPIO27";

gpio27.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio27.$name           = "inst_GPIO30";
gpio27.gpioPin.$assign = "GPIO30";

gpio28.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio28.$name           = "inst_GPIO32";
gpio28.gpioPin.$assign = "GPIO32";

gpio29.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio29.$name           = "inst_GPIO33";
gpio29.gpioPin.$assign = "GPIO33";

gpio30.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio30.$name           = "inst_GPIO36";
gpio30.gpioPin.$assign = "GPIO36";

gpio31.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio31.$name           = "inst_GPIO43";
gpio31.gpioPin.$assign = "GPIO43";

gpio32.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio32.$name           = "inst_GPIO53";
gpio32.gpioPin.$assign = "GPIO53";

gpio33.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio33.$name           = "inst_GPIO54";
gpio33.gpioPin.$assign = "GPIO54";

gpio34.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio34.$name           = "inst_GPIO55";
gpio34.gpioPin.$assign = "GPIO55";

gpio35.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio35.$name           = "inst_GPIO56";
gpio35.gpioPin.$assign = "GPIO56";

gpio36.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio36.$name           = "inst_GPIO57";
gpio36.gpioPin.$assign = "GPIO57";

gpio37.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio37.$name           = "inst_GPIO62";
gpio37.gpioPin.$assign = "GPIO62";

gpio38.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio38.$name           = "inst_GPIO63";
gpio38.gpioPin.$assign = "GPIO63";

gpio39.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio39.$name           = "inst_GPIO64";
gpio39.gpioPin.$assign = "GPIO64";

gpio40.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio40.$name           = "inst_GPIO65";
gpio40.gpioPin.$assign = "GPIO65";

gpio41.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio41.$name           = "inst_GPIO66";
gpio41.gpioPin.$assign = "GPIO66";

gpio42.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio42.$name           = "inst_GPIO84";
gpio42.gpioPin.$assign = "GPIO84";

gpio43.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio43.$name           = "inst_GPIO93";
gpio43.gpioPin.$assign = "GPIO93";

gpio44.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio44.$name           = "inst_GPIO94";
gpio44.gpioPin.$assign = "GPIO94";

gpio45.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio45.$name           = "inst_GPIO95";
gpio45.gpioPin.$assign = "GPIO95";

gpio46.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio46.$name           = "inst_GPIO96";
gpio46.gpioPin.$assign = "GPIO96";

gpio47.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio47.$name           = "inst_GPIO97";
gpio47.gpioPin.$assign = "GPIO97";

gpio48.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio48.$name           = "inst_GPIO98";
gpio48.gpioPin.$assign = "GPIO98";

gpio49.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio49.$name           = "inst_GPIO99";
gpio49.gpioPin.$assign = "GPIO99";

gpio50.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio50.$name           = "inst_GPIO100";
gpio50.gpioPin.$assign = "GPIO100";

gpio51.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio51.$name           = "inst_GPIO101";
gpio51.gpioPin.$assign = "GPIO101";

gpio52.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio52.$name           = "inst_GPIO102";
gpio52.gpioPin.$assign = "GPIO102";

gpio53.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio53.$name           = "inst_GPIO103";
gpio53.gpioPin.$assign = "GPIO103";

gpio54.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio54.$name           = "inst_GPIO104";
gpio54.gpioPin.$assign = "GPIO104";

gpio55.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio55.$name           = "inst_GPIO105";
gpio55.gpioPin.$assign = "GPIO105";

gpio56.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio56.$name           = "inst_GPIO108";
gpio56.gpioPin.$assign = "GPIO108";

gpio57.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio57.$name           = "inst_GPIO110";
gpio57.gpioPin.$assign = "GPIO110";

gpio58.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio58.$name           = "inst_GPIO111";
gpio58.gpioPin.$assign = "GPIO111";

gpio59.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio59.$name           = "inst_GPIO119";
gpio59.gpioPin.$assign = "GPIO119";

gpio60.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio60.$name           = "inst_GPIO125";
gpio60.gpioPin.$assign = "GPIO125";

