convesys/CS-1211_Test/05_Project/SW_TEST_sysconfig_337zwt/c2000.syscfg
gpio61.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio61.$name           = "inst_GPIO126";
gpio61.gpioPin.$assign = "GPIO126";

gpio62.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio62.$name           = "inst_GPIO127";
gpio62.gpioPin.$assign = "GPIO127";

gpio63.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio63.$name           = "inst_GPIO128";
gpio63.gpioPin.$assign = "GPIO128";

gpio64.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio64.$name           = "inst_GPIO129";
gpio64.gpioPin.$assign = "GPIO129";

gpio65.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio65.$name           = "inst_GPIO130";
gpio65.gpioPin.$assign = "GPIO130";

gpio66.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio66.$name           = "inst_GPIO131";
gpio66.gpioPin.$assign = "GPIO131";

gpio67.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio67.$name           = "inst_GPIO132";
gpio67.gpioPin.$assign = "GPIO132";

gpio68.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio68.$name           = "inst_GPIO133";
gpio68.gpioPin.$assign = "GPIO133";

gpio69.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio69.$name           = "inst_GPIO134";
gpio69.gpioPin.$assign = "GPIO134";

gpio70.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio70.$name           = "inst_GPIO135";
gpio70.gpioPin.$assign = "GPIO135";

gpio71.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio71.$name           = "inst_GPIO136";
gpio71.gpioPin.$assign = "GPIO136";

gpio72.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio72.$name           = "inst_GPIO137";
gpio72.gpioPin.$assign = "GPIO137";

gpio73.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio73.$name           = "inst_GPIO138";
gpio73.gpioPin.$assign = "GPIO138";

gpio74.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio74.$name           = "inst_GPIO139";
gpio74.gpioPin.$assign = "GPIO139";

gpio75.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio75.$name           = "inst_GPIO140";
gpio75.gpioPin.$assign = "GPIO140";

gpio76.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio76.$name           = "inst_GPIO141";
gpio76.gpioPin.$assign = "GPIO141";

gpio77.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio77.$name           = "inst_GPIO142";
gpio77.gpioPin.$assign = "GPIO142";

gpio78.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio78.$name           = "inst_GPIO143";
gpio78.gpioPin.$assign = "GPIO143";

gpio79.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio79.$name           = "inst_GPIO144";
gpio79.gpioPin.$assign = "GPIO144";

gpio80.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio80.$name           = "inst_GPIO145";
gpio80.gpioPin.$assign = "GPIO145";

gpio81.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio81.$name           = "inst_GPIO146";
gpio81.gpioPin.$assign = "GPIO146";

gpio82.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio82.$name           = "inst_GPIO147";
gpio82.gpioPin.$assign = "GPIO147";

gpio83.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio83.$name           = "inst_GPIO148";
gpio83.gpioPin.$assign = "GPIO148";

gpio84.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio84.$name           = "inst_GPIO149";
gpio84.gpioPin.$assign = "GPIO149";

gpio85.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio85.$name           = "inst_GPIO150";
gpio85.gpioPin.$assign = "GPIO150";

gpio86.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio86.$name           = "inst_GPIO151";
gpio86.gpioPin.$assign = "GPIO151";

gpio87.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio87.$name           = "inst_GPIO152";
gpio87.gpioPin.$assign = "GPIO152";

gpio88.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio88.$name           = "inst_GPIO153";
gpio88.gpioPin.$assign = "GPIO153";

gpio89.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio89.$name           = "inst_GPIO154";
gpio89.gpioPin.$assign = "GPIO154";

gpio90.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio90.$name           = "inst_GPIO155";
gpio90.gpioPin.$assign = "GPIO155";

gpio91.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio91.$name           = "inst_GPIO156";
gpio91.gpioPin.$assign = "GPIO156";

gpio92.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio92.$name           = "inst_GPIO157";
gpio92.gpioPin.$assign = "GPIO157";

gpio93.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio93.$name           = "inst_GPIO158";
gpio93.gpioPin.$assign = "GPIO158";

gpio94.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio94.$name           = "inst_GPIO159";
gpio94.gpioPin.$assign = "GPIO159";

gpio95.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio95.$name           = "inst_GPIO160";
gpio95.gpioPin.$assign = "GPIO160";

gpio96.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio96.$name           = "inst_GPIO161";
gpio96.gpioPin.$assign = "GPIO161";

gpio97.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio97.$name           = "inst_GPIO162";
gpio97.gpioPin.$assign = "GPIO162";

gpio98.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio98.$name           = "inst_GPIO163";
gpio98.gpioPin.$assign = "GPIO163";

gpio99.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio99.$name           = "inst_GPIO164";
gpio99.gpioPin.$assign = "GPIO164";

gpio100.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio100.$name           = "inst_GPIO165";
gpio100.gpioPin.$assign = "GPIO165";

gpio101.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio101.$name           = "inst_GPIO166";
gpio101.gpioPin.$assign = "GPIO166";

gpio102.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio102.$name           = "inst_GPIO167";
gpio102.gpioPin.$assign = "GPIO167";

gpio103.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio103.$name           = "inst_GPIO168";
gpio103.gpioPin.$assign = "GPIO168";

gpio104.qualMode        = "GPIO_QUAL_3SAMPLE";
gpio104.$name           = "inst_GPIO72";
gpio104.gpioPin.$assign = "GPIO72";

sci1.selectRegisteredInterrupts = ["registerRxInt","registerTxInt"];
sci1.enabledInterrupts          = ["SCI_INT_RXRDY_BRKDT","SCI_INT_TXRDY"];
sci1.enabledErrorInterrupts     = ["SCI_INT_FE","SCI_INT_OE","SCI_INT_PE","SCI_INT_RXERR"];
sci1.$name                      = "SCIA_inst";
sci1.parity                     = "SCI_CONFIG_PAR_EVEN";
sci1.enabledFIFOInterrupts      = ["SCI_INT_RXFF","SCI_INT_TXFF"];
sci1.rxFifo                     = "SCI_FIFO_RX1";
sci1.sci.$assign                = "SCIA";
sci1.sci.scirxdPin.$assign      = "GPIO28";
sci1.sci.scitxdPin.$assign      = "GPIO29";
sci1.rxQual.$name               = "myGPIOQUAL0";
sci1.rxQual.qualMode            = "GPIO_QUAL_3SAMPLE";
sci1.txQual.$name               = "myGPIOQUAL1";
sci1.txQual.qualMode            = "GPIO_QUAL_3SAMPLE";
sci1.txQual.padConfig           = "STD";
sci1.sciRXInt.enableInterrupt   = true;
sci1.sciTXInt.enableInterrupt   = true;

sysctl.enableNMIGlobalInterrupt = true;
sysctl.splitCode                = true;
